server/load-test-stress.yml
config:
  target: "http://localhost:4400"
  phases:
    # Warm up - 50 users/sec for 30 seconds
    - duration: 30
      arrivalRate: 50
      name: "Warm up"

    # Ramp up - 50 to 500 users/sec over 60 seconds
    - duration: 60
      arrivalRate: 50
      rampTo: 500
      name: "Ramp up to 500/sec"

    # Sustained heavy load - 500 users/sec for 120 seconds
    - duration: 120
      arrivalRate: 500
      name: "Sustained 500/sec"

    # Extreme spike - 1000 users/sec for 30 seconds
    - duration: 30
      arrivalRate: 1000
      name: "Spike 1000/sec"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/api/health"

  - name: "Get Tasks"
    weight: 3
    flow:
      - get:
          url: "/api/tasks"

  - name: "Get User Info"
    weight: 2
    flow:
      - get:
          url: "/api/user/me"